Revit 2024 API
ImportOptions3DM Class
 The import options used to import 3DM format files.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public class ImportOptions3DM : BaseImportOptions
Visual Basic
Public Class ImportOptions3DM _
	Inherits BaseImportOptions
Visual C++
public ref class ImportOptions3DM : public BaseImportOptions
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BaseImportOptions
 Autodesk.Revit.DB.ImportOptions3DM
See Also
ImportOptions3DM Members
Autodesk.Revit.DB Namespace